# res_data = [{"date": "20231016", "restaurant": "기숙사식당", "menu": {"조식": ["콩나물국", "쌀밥", "모듬까스&칠리s", "귤컵쥬스", "구이김", "배추김치", "계란후라이"], "중식": ["어묵국", "쌀밥&흑미밥", "제육바싹불고기", "맛쵸킹김말이", "콩나물무침", "배추김치", "요구르트"], "석식": ["스팸마요덮밥", "미소장국", "미니돈까스&감자튀김", "마카로니콘샐러드", "무말랭이무침", "배추김치", "요구르트"]}},
# {"date": "20231017", "restaurant": "기숙사식당", "menu": {"조식": ["물만두국", "쌀밥", "떡갈비볶음", "오이지무침", "구이김", "배추김치", "계란후라이"], "중식": ["얼큰김치찌개", "쌀밥&흑미밥", "순대야채볶음", "뿌링치즈치킨너겟", "새콤쌈무무침", "배추김치", "요구르트"], "석식": ["유부잔치국수(大)", "쌀밥", "춘권,사모사&칠리s", "볼어묵비엔나볶음", "무짠지무침", "배추김치", "요구르트"]}},
# {"date": "20231018", "restaurant": "기숙사식당", "menu": {"조식": ["미역국", "쌀밥", "비엔나미트볼폭찹", "연두부&양념장", "구이김", "배추김치", "계란후라이"], "중식": ["얼큰짬뽕(면)", "쌀밥&흑미밥", "짜장소스", "모듬탕수육&후르츠s", "단무지/짜사이무침", "배추김치", "콜라"], "석식": ["가츠동", "두부장국/추가밥", "떡볶이", "김말이,군만두", "단무지무침", "배추김치", "요구르트"]}},
# {"date": "20231019", "restaurant": "기숙사식당", "menu": {"조식": ["김칫국", "쌀밥", "치킨까스&샐러드", "모닝빵&딸기잼", "구이김", "배추김치", "계란후라이"], "중식": ["미역국", "쌀밥", "돈사태김치찜", "교자만두튀김", "후랑크핫바", "구이김", "요구르트"], "석식": ["마파두부/새우튀김", "쌀밥(덮밥)", "유부장국", "시즈닝치즈감자", "꼬들단무지무침", "배추김치", "요구르트"]}},
# {"date": "20231020", "restaurant": "기숙사식당", "menu": {"조식": ["순두부찌개", "쌀밥", "모듬장조림", "도토리묵무침", "구이김", "배추김치", "계란후라이"], "중식": ["김치콩나물국", "쌀밥", "파파돈까스&샐러드", "스모크햄어묵볶음", "고추지무침", "배추김치", "요구르트"], "석식": ["로제크림스파게티", "유부장국", "쌀밥", "함박야채스테이크", "야채피클", "배추김치", "요구르트"]}}, {"date": "20231021", "restaurant": "기숙사식당", "menu": {"조식": ["주말 운영시간n", "11:20~13:30 (중식)n", "17:00~18:20 (석식)n", "주말 조식은 운영하지 않습니다."], "중식": ["두부장국", "쌀밥", "제육간장불고기", "모듬까스&허니s", "오이지무침", "배추김치", "요구르트"], "석식": ["고추장수제비", "쌀밥", "팝콘치킨강정", "멕시칸샐러드", "무짠지무침", "배추김치", "요구르트"]}}, {"date": "20231022", "restaurant": "기숙사식당", "menu": {"조식": ["주말 운영시간n", "11:20~13:30 (중식)n", "17:00~18:20 (석식)n", "주말 조식은 운영하지 않습니다."], "중식": ["부대찌개", "쌀밥", "맛동산탕수육", "맛살미역줄기볶음", "단무지무침", "배추김치", "요구르트"], "석식": ["어묵국", "쌀밥", "해물커틀렛&타르s", "매콤두부조림", "깻잎지", "배추김치", "요구르트"]}}]

# for data in res_data:
#     print(data['date'])
#     print(data['menu']['조식'])
#     print(data['menu']['중식'])
#     print(data['menu']['석식'])
#     print()

import requests
import datetime

date = datetime.datetime(2023, 10, 16)
webpage = requests.get(
    url=f'https://ssudorm.ssu.ac.kr:444/SShostel/mall_main.php',
    params={'viewform': 'B0001_foodboard_list', 'gyear': date.year, 'gmonth': date.month, 'gday': date.day})

print(webpage.content)

current_date = datetime.date.today().strftime("%Y%m%d")

dorm_res = requests.get(url="https://drvrj3q50b.execute-api.ap-northeast-2.amazonaws.com/get_dormitory",params={"date":current_date})


